src/test/resources/com/stripe/model/invoice.json

{
  "id": "in_8vzsBYq9vA4uHF",
  "object": "invoice",
  "amount_due": 6000,
  "application_fee": null,
  "attempt_count": 1,
  "attempted": true,
  "charge": "ch_8vzszxcNLVJXqF",
  "closed": true,
  "currency": "usd",
  "customer": "cus_8DiGyHUyZFiabU",
  "date": 1470163519,
  "description": null,
  "discount": null,
  "ending_balance": 0,
  "forgiven": false,
  "lines": {
    "object": "list",
    "data": [
      {
        "id": "sub_8vzs5GcsrEzdnn",
        "object": "line_item",
        "amount": 6000,
        "currency": "usd",
        "description": null,
        "discountable": true,
        "livemode": false,
        "metadata": {},
        "period": {
          "start": 1470163519,
          "end": 1501699519
        },
        "plan": {
          "id": "silver",
          "object": "plan",
          "amount": 6000,
          "created": 1446839863,
          "currency": "usd",
          "interval": "year",
          "interval_count": 1,
          "livemode": false,
          "metadata": {},
          "name": "Silver Plan",
          "statement_descriptor": null,
          "trial_period_days": null,
          "statement_description": null
        },
        "proration": false,
        "quantity": 1,
        "subscription": null,
        "type": "subscription"
      }
    ],
    "has_more": false,
    "total_count": 1,
    "url": "/v1/invoices/in_8vzsBYq9vA4uHF/lines"
  },
  "livemode": false,
  "metadata": {},
  "next_payment_attempt": null,
  "paid": true,
  "period_end": 1470163519,
  "period_start": 1459950108,
  "receipt_number": null,
  "starting_balance": 0,
  "statement_descriptor": null,
  "subscription": "sub_8vzs5GcsrEzdnn",
  "subtotal": 6000,
  "tax": 0,
  "tax_percent": 0,
  "total": 6000,
  "webhooks_delivered_at": 1470163519,
  "statement_description": null,
  "payment": "ch_8vzszxcNLVJXqF"
}